InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_Доверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_Доверенности</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусДоверенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыДоверенностей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийДоверенность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Доверенности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПлательщикиКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПлательщикиКлиента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СтатусыЗалогодателейСлужебные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыЗалогодателейСлужебные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СлужебныеСтатусыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыДоверенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДоверенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нотариальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письменная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОСмерти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыНакладнойНаОтгрузку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаОткрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаЗакрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыДоверенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыДоверенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоверенностьОформлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверенностьОтозвана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СмертьДоверителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СмертьДоверенногоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеПрекращено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверенностьОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеПрекращеноЗаймВыкуплен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ПоискЗалогодателяПоНомеруБилета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидОперации") Тогда
		ВидОперации = Параметры.ВидОперации;
	КонецЕсли;
	Если Параметры.Свойство("Номер") Тогда
		Номер = Параметры.Номер;  
		Элементы.Номер.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Номер.ТолькоПросмотр = Ложь;
	КонецЕсли;
	Если Параметры.Свойство("ЭтоКасса") Тогда
		ЭтоКасса = Параметры.ЭтоКасса;
	КонецЕсли; 
	Если Параметры.Свойство("Ломбард") Тогда
		ТекущийЛомбард = Параметры.Ломбард;
	КонецЕсли;  

	
	Если ЭтоКасса Тогда
		Элементы.Плательщики.Видимость =ложь;
	Иначе	
		Если ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ПустаяСсылка() Тогда 
			ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
		КонецЕсли;	                                                                   
		
		Если ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога ИЛИ 
			 ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога ИЛИ 
			 ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОстановкаПроцентов ИЛИ
			 ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога ИЛИ  
			 ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления ИЛИ
			//+Мельников 25.04.24 Отмена операции
			ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты Тогда
			//-Мельников
			Элементы.Плательщики.Видимость =ложь;
		ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление ИЛИ ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога Тогда
			Элементы.ПлательщикиКнопкаСоздать.Видимость =ложь;
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога Тогда
			Элементы.ПлательщикиПлательщик.Заголовок = "Получатель"; 
			Элементы.ПлательщикиСтатус.Заголовок = "Статус получателя";
		КонецЕсли;
		//+Мельников 25.04.24 Для отображения последней операции
		Если ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты Тогда
			Элементы.Операции.Видимость = Истина;
		КонецЕсли;
		//-Мельников   
	КонецЕсли;	
	Если Параметры.Свойство("Номер") Тогда
		Номер = Параметры.Номер;
		НайтиВозможныеВариантыЗалогодатели();
	КонецЕсли;
КонецПроцедуры  


&НаСервере
Процедура НайтиВозможныеВариантыЗалогодатели()
	Если НЕ ПустаяСтрока(Номер) Тогда
		Залогодатели.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Номер", "%"+Номер+"%");		
		//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		//               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период КАК Период,
		//               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ДокументЗалога,
		//               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
		//               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет.НомерЗалоговогоБилета КАК Номер,
		//               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ДатаРождения КАК ДатаРождения,
		//               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ДатаСмерти КАК ДатаСмерти,
		//               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
		//               |ИЗ
		//               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(, ЗалоговыйБилет.НомерЗалоговогоБилета ПОДОБНО &Номер) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателей
		//               |		ПО ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет.Залогодатель = ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель
		//               |
		//               |УПОРЯДОЧИТЬ ПО
		//               |	Период УБЫВ";  	
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет КАК ДокументЗалога,
		               |	ЛБ_СостояниеЗалоговогоБилета.Залогодатель КАК Залогодатель,
		               |	ЛБ_СостояниеЗалоговогоБилета.НомерЗалоговогоБилета КАК Номер,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ДатаРождения КАК ДатаРождения,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ДатаСмерти КАК ДатаСмерти,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
		               |ИЗ
		               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(, ) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
		               |		ПО ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателей
		               |		ПО ЛБ_СостояниеЗалоговогоБилета.Залогодатель = ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель
		               |ГДЕ
		               |	ЛБ_СостояниеЗалоговогоБилета.НомерЗалоговогоБилета ПОДОБНО &Номер";  	

		
		Запрос.УстановитьПараметр("Номер", "%"+Номер+"%");
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
				
		Залогодатели.Загрузить(ТаблицаЗапроса); 
		Если НЕ Залогодатели.Количество() = 0  Тогда   
			//проверим возможность выполнения операции  
			Если ЭтоКасса Тогда   
				Элементы.Залогодатели.ТекущаяСтрока  = Залогодатели[0].ПолучитьИдентификатор();
				Возврат;
			КонецЕсли;	
			Для каждого СтрЗ Из Залогодатели Цикл
				Если ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога Тогда
					Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение И
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство Тогда 
						СтрЗ.НельзяВыбрать = Истина;
					КонецЕсли;
				ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда	
					Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен И
			             НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен И 
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен И
                         НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят И
			             НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен И  
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную И  
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг И
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство Тогда
                       СтрЗ.НельзяВыбрать = Истина;
				    КонецЕсли;   
					Если СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда
						Если ЛБ_УправлениеЛомбардом.ПроверитьЗалоговыйБилетСогласованКОплате(ТекущаяДатаСеанса(), СтрЗ.ДокументЗалога) Тогда 
							СтрЗ.НельзяВыбрать = Ложь;
						КонецЕсли;	
					КонецЕсли;	
				ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда	
					Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен И
			             НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен И						 
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен И  
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную И  
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг И
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство И  
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение Тогда
                       СтрЗ.НельзяВыбрать = Истина;
					КонецЕсли;
				ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОстановкаПроцентов Тогда 
					Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен И
			             НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен И
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство И 
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную И  
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг Тогда 
                       СтрЗ.НельзяВыбрать = Истина;
				    КонецЕсли;    
				ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога Тогда  
					Если НЕ ТекущийЛомбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда	
						Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен И
				             НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен И 
							 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение И 
	                         НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят И
				             НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен И 
							 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен И
							 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную И  
							 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг И
							 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство Тогда
	                       СтрЗ.НельзяВыбрать = Истина;     
					   КонецЕсли;
					КонецЕсли;   
				ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога Тогда 
					Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят И
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство Тогда
                       СтрЗ.НельзяВыбрать = Истина;
			        КонецЕсли;   
                ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВозвратаИзъятого Тогда 
					Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят И
						НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен И
						НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную И  
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг Тогда
                       СтрЗ.НельзяВыбрать = Истина;
				   КонецЕсли;   
				ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВыдачиСОХ Тогда 
					Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт Тогда
                       СтрЗ.НельзяВыбрать = Истина;
				    КонецЕсли;
				ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога ИЛИ ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления Тогда 
                    Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен Тогда
                       СтрЗ.НельзяВыбрать = Истина;
				    КонецЕсли;    
                ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОстановкиНачисленияПроцентов Тогда 
                    Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда
                       СтрЗ.НельзяВыбрать = Истина;
				    КонецЕсли;      
				ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаИзъятия Тогда 
                    Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят Тогда
                       СтрЗ.НельзяВыбрать = Истина;
				    КонецЕсли;    
				ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты Тогда 
					Если НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен И
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен И
                         НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят И
			             НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен И  
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную И  
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг И
						 //+Мельников 20.06.24 Нельзя было выполнить отмену выкупа
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт И
						 //+Мельников 08.07.24 Нельзя было выполнить отмену остановки начислений процентов
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен И
						 //+МАН 20.06.25 Нельзя было выполнить отмену "На ОХ"
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение И
						 //-Мельников
						 НЕ СтрЗ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство Тогда
                       СтрЗ.НельзяВыбрать = Истина;
				    КонецЕсли;   
                КонецЕсли;
			Конеццикла;	
			Элементы.Залогодатели.ТекущаяСтрока  = Залогодатели[0].ПолучитьИдентификатор();
		КонецЕсли;	
	Иначе
		Залогодатели.Очистить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьКлиента();
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	НайтиВозможныеВариантыЗалогодатели();
КонецПроцедуры

&НаКлиенте
Процедура НомерОчистка(Элемент, СтандартнаяОбработка)
	Номер = "";
	НайтиВозможныеВариантыЗалогодатели();
КонецПроцедуры

&НаКлиенте
Процедура Выбор(Команда)
	ВыбратьКлиента();
КонецПроцедуры  

&НаСервере
Функция ПолучитьДокументЗалогодателяИзЗалоговогоБилета(ДокументЗалога)
	Возврат ДокументЗалога.ДокументЗалогодателя;
КонецФункции	

&НаСервере
Функция ПроверитьДокументыКлиента(Клиент) 
	ВсеОК = Истина;      
	Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Клиент, ТекущаяДата()) = неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбранный клиент умер. Операции с клиентом не возможны!");
		Возврат Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Гражданство = Выборка.Гражданство;
		ДокументЗалогодателя = ЛБ_УправлениеЛомбардом.ПроверитьОсновнойДокумент(ТекущаяДата(), Клиент, Гражданство);
		Если НЕ ЗначениеЗаполнено(ДокументЗалогодателя) тогда 
			ОбщегоНазначения.СообщитьПользователю("Основной документ удостоверяющий личность выбранного клиента не найден!");
			ВсеОК = Ложь;
		КонецЕсли;
		Если НЕ Гражданство = Справочники.СтраныМира.Россия тогда 
			ДопДокументы = ЛБ_УправлениеЛомбардом.ПолучитьДокументыПравоПребыванияРФ(ТекущаяДата(), Клиент, Гражданство);
			Если ДопДокументы.Количество() = 0 тогда 
				ОбщегоНазначения.СообщитьПользователю("Не найдены основные документы, подверждающие право клиента на пребывание В РФ!");
				ВсеОК = Ложь;
			КонецЕсли;
		КонецЕсли;	
	Иначе       
		ОбщегоНазначения.СообщитьПользователю("Не определено гражданство выбранного клиента!");
		ВсеОК = Ложь;	
	КонецЕсли;	
	Возврат ВсеОК;
КонецФункции  

&НаСервере
Функция ПроверитьДокументыПредставителяКлиента(Клиент) 
	ВсеОК = Истина;      
	Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Клиент, ТекущаяДата()) = неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбранный представитель заемщика умер. Операции с клиентом не возможны!");
		Возврат Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Гражданство = Выборка.Гражданство;
		ДокументПредставителя = ЛБ_УправлениеЛомбардом.ПроверитьОсновнойДокумент(ТекущаяДата(), Клиент, Гражданство);
		Если НЕ ЗначениеЗаполнено(ДокументЗалогодателя) тогда 
			ОбщегоНазначения.СообщитьПользователю("Основной документ удостоверяющий личность выбранного представителя заемщика не найден!");
			ВсеОК = Ложь;
		КонецЕсли;
		Если НЕ Гражданство = Справочники.СтраныМира.Россия тогда 
			ДопДокументы = ЛБ_УправлениеЛомбардом.ПолучитьДокументыПравоПребыванияРФ(ТекущаяДата(), Клиент, Гражданство);
			Если ДопДокументы.Количество() = 0 тогда 
				ОбщегоНазначения.СообщитьПользователю("Не найдены основные документы, подверждающие право представителя заемщика на пребывание В РФ!");
				ВсеОК = Ложь;
			КонецЕсли;
		КонецЕсли;	
	Иначе       
		ОбщегоНазначения.СообщитьПользователю("Не определено гражданство выбранного представителя заемщика!");
		ВсеОК = Ложь;	
	КонецЕсли;	
	Возврат ВсеОК;
КонецФункции

&НаСервере
Функция ПолучитьОперациюЗалога(Документ)
	Возврат Документ.ВидОперации;
КонецФункции

&НаСервере
Функция ЭтоНаследник(Идентификатор)
	СтрП = Плательщики.НайтиПоИдентификатору(Идентификатор);
	Если НЕ ЗначениеЗаполнено(СтрП.Доверенность) Тогда
		Возврат Ложь;  
	ИначеЕсли НЕ СтрП.Доверенность.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.СвидетельствоОСмерти Тогда
		Возврат Ложь; 
	КонецЕсли;	      
	Возврат Истина;
КонецФункции

&НаСервере
Функция ПолучитьСтатусЗБ(ЗалоговыйБилет)
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДата(), ЗалоговыйБилет);
КонецФункции

&НаСервере
Функция ПолучитьНомерЛомбардаЗБ(ЗалоговыйБилет)
	Возврат ЗалоговыйБилет.Ломбард.НомерЛомбарда;
КонецФункции

&НаСервере
Функция ПолучитьНомерЛомбардаПользователя()
    ЛомбардП = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
	Возврат ЛомбардП.НомерЛомбарда;
КонецФункции
 
&НаСервере
Функция ПроверитьСтатусНакладной(ЗалоговыйБилет)
	//+МАН 02.12.24 Изменил выполняемую процедуру. Заявка 2904
	//Возврат ЛБ_УправлениеЛомбардом.ПолучитьСтатусНакладнойПоЗБ(ТекущаяДатаСеанса(), ЗалоговыйБилет); 
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьСтатусНакладнойПоЗБИзм(ТекущаяДатаСеанса(), ЗалоговыйБилет);
	//-МАН
КонецФункции  

&НаСервере
Функция ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку)  
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("Номер", НакладнаяНаОтгрузку.ПредставлениеНомераНакладной); 
	СтруктураВ.Вставить("Дата", НакладнаяНаОтгрузку.Дата);
	Возврат СтруктураВ; 
КонецФункции

&НаСервере 
Функция ПроверитьИзделияВЦО(ЗалоговыйБилет) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);  
	Запрос.УстановитьПараметр("Ломбард", ТекущийЛомбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
	               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	               |			,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОстатки
	               |ГДЕ
	               |	НЕ ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток = 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаОстатки.Склад,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард,
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОбъектЗалога";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Истина;
	КонецЕсли;	
    Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ВыбратьКлиента()                                                                                           
	ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;
	Если ТекущаяСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ЭтоКасса Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ЗалоговыйБилет", ТекущаяСтрока.ДокументЗалога);
		СтруктураВозврата.Вставить("Залогодатель", ТекущаяСтрока.Залогодатель);
		ЭтаФорма.Закрыть(СтруктураВозврата);
	КонецЕсли;	
	
	//+МАН 02.12.24 Передвинул выполнение проверок для корректного отробатывания предупреждений. Заявка 2904
	СтруктураНакладной = ПроверитьСтатусНакладной(ТекущаяСтрока.ДокументЗалога); 
	Если СтруктураНакладной = неопределено Тогда
		ЕстьВНакладной = Ложь;
	Иначе	         
		ЕстьВНакладной = Истина;
	    НакладнаяНаОтгрузку = СтруктураНакладной.НакладнаяНаОтгрузку; 
		СтатусНакладной = СтруктураНакладной.СтатусНакладной;
	КонецЕсли;
	//-МАН
	
	Если ТекущаяСтрока.НельзяВыбрать Тогда //+МАН 02.12.24 Добавлено условие на наличие в накладной. Заявка 2904  
		СтрокаСтатус = ?(ЗначениеЗаполнено(ТекущаяСтрока.СтатусЗалоговогоБилета), Строка(ТекущаяСтрока.СтатусЗалоговогоБилета), "не определен");
		//Если НЕ ЕстьВНакладной Тогда
		//	Предупреждение("Статус выбранного залогового билета """ + СтрокаСтатус + """. Выполнение операции невозможно!", 60); //lion 14.08.2025 
		//Иначе	
			Если ТекущаяСтрока.СтатусЗалоговогоБилета = предопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Отгружен") Тогда
				Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда
				    ТекстПредупреждения = "Внимание! ЗБ № " + СокрЛП(Номер)
					     + " в статусе «Отгружен»." + Символы.ПС + "Для согласования возможности приема оплаты/выкупа обратитесь в ЦО.";
					Предупреждение(ТекстПредупреждения, 60);
		        Иначе
					Предупреждение("Внимание! ЗБ № " + СокрЛП(Номер) + " в статусе «Отгружен». Проведение операции невозможно!", 60);  
				КонецЕсли;	  
			Иначе 			
				Предупреждение("Статус выбранного залогового билета """ + СтрокаСтатус + """. Выполнение операции невозможно!", 60); //lion 14.08.2025
			КонецЕсли;
		//КонецЕсли;	
		Возврат;
	КонецЕсли;	     
	
	//+МАН 02.12.24 Закомментировал и перенес выше. Заявка 2904
	//СтруктураНакладной = ПроверитьСтатусНакладной(ТекущаяСтрока.ДокументЗалога); 
	//Если СтруктураНакладной = неопределено Тогда
	//	ЕстьВНакладной = Ложь;
	//Иначе	         
	//	ЕстьВНакладной = Истина;
	//    НакладнаяНаОтгрузку = СтруктураНакладной.НакладнаяНаОтгрузку; 
	//	СтатусНакладной = СтруктураНакладной.СтатусНакладной;
	//КонецЕсли;
	//-МАН    
	
	//+МАН 27.10.25
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") //Выдача займа
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") //Оплата процентов
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") //Переоформление
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда //Выдача залога
		
		ЕстьСовпадение = ПроверитьКлиента(ТекущаяСтрока.Залогодатель);
		
		Если ЕстьСовпадение Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	//-МАН

	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда
		Если ЕстьВНакладной Тогда     
		    СтруктураН = ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку);	
		    ТекстПредупреждения = "Внимание! Изделия по ЗБ № " + СокрЛП(Номер) + " в накладной № " + СокрЛП(СтруктураН.Номер)+ " от " + Формат(СтруктураН.Дата, "ДЛФ=DT");
		    Если СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена") Тогда	
				//+МАН 16.12.24 Изменил сообщение. Заявка 2904.
				ТекстПредупреждения = ТекстПредупреждения + " в статусе «Отгружено»." + Символы.ПС + "Для согласования возможности приема оплаты/переоформления обратитесь в ЦО.";
			    //-МАН
				Предупреждение(ТекстПредупреждения, 60);
				Возврат;
			//+МАН 08.08.25 Сделал проверку как была раньше. Иначе нельзя ни чего оплатить. Заявка 3425.
			ИначеЕсли СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаОткрыта") ИЛИ  
				      СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта") Тогда   
			//Было: Иначе
			//-МАН
			   НомерЛомбардаЗБ = ПолучитьНомерЛомбардаЗБ(ТекущаяСтрока.ДокументЗалога);	
			   НомерЛомбарда = ПолучитьНомерЛомбардаПользователя();
			   Если НЕ СокрЛП(НомерЛомбардаЗБ) = СокрЛП(НомерЛомбарда) Тогда
				   ТекстПредупреждения = "Внимание! Изделия по ЗБ № " + СокрЛП(Номер) + " в сумке! Для проведения оплаты свяжитесь с ломбардом № " + СокрЛП(НомерЛомбардаЗБ) + ".";	  
			//+МАН 08.08.25 Изменил проверку т.к. сообщение у открытой и закрытой сумки одинаковое.
			   //Было: ИначеЕсли СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта") Тогда			  
		   	   Иначе
			//Изменил сообщение
			        ТекстПредупреждения = "Внимание! Изделия по ЗБ № " + СокрЛП(Номер) + " в сумке." + Символы.ПС
					+ "Для оплаты/выкупа/переоформления ЗБ измените статус накладной № " + СокрЛП(СтруктураН.Номер)+ " от " + Формат(СтруктураН.Дата, "ДФ=dd.MM.yyyy") + " и вскройте сумку.";
					
			       //Было: ТекстПредупреждения = ТекстПредупреждения + " в сумке." + Символы.ПС + "Для оплаты/выкупа/переоформления ЗБ измените статус накладной и вскройте сумку.";
			//
			   КонецЕсли;
			   Предупреждение(ТекстПредупреждения, 60);
			   Возврат;
		   КонецЕсли;	   
		КонецЕсли;	
		ПараметрыФормы = Новый Структура;
	    ТекущаяСтрокаП = Элементы.Плательщики.ТекущиеДанные;
		Если ТекущаяСтрокаП = неопределено Тогда
			Клиент = ТекущаяСтрока.Залогодатель;
		Иначе
			Клиент = ТекущаяСтрокаП.Плательщик;
		КонецЕсли;						
		Если НЕ ПроверитьДокументыКлиента(Клиент) тогда
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОткрытиеКарточки", ЭтотОбъект); 
            ПоказатьВопрос(Оповещение, "Открыть карточку клиента?", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
		Иначе  
			ОбработатьВыборКлиента();
		КонецЕсли;	
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда
		ЛомбардПользователя = ПолучитьЛомбардПольвателя(); 
		ЛомбардВДокументе = ПолучитьЛомбардВдокументе(ТекущаяСтрока.ДокументЗалога);
		Если ЛомбардПользователя <> ЛомбардВДокументе Тогда
			Предупреждение("Операция оформлена в другом ломбарде.
			|Действия с документом запрещены!");
			Возврат
		КонецЕсли;
		
		СтатусЗБ = ТекущаяСтрока.СтатусЗалоговогоБилета;
		//Если СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Изъят") ИЛИ СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Возвращен") Тогда 
		//	Предупреждение("По выбраному залоговому билету была оформлена операция ""Изъятие объектов залога"". Переоформление невозможно.", 60);
		//	Возврат;
		//КонецЕсли;    
		
		Если ЕстьВНакладной Тогда 
			СтруктураН = ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку);
		    ТекстПредупреждения = "Предметы залога по ЗБ № " + СокрЛП(Номер) + " в накладной № " + СокрЛП(СтруктураН.Номер)+ " от " + Формат(СтруктураН.Дата, "ДЛФ=DT");
		    ТекстПредупреждения = "Внимание! Изделия по ЗБ № " + СокрЛП(Номер) + " в накладной № " + СокрЛП(СтруктураН.Номер)+ " от " + Формат(СтруктураН.Дата, "ДЛФ=DT");
		    Если СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена") Тогда	
				ТекстПредупреждения = ТекстПредупреждения + " в статусе «Отгружено»." + Символы.ПС + "Для согласования возможности переоформления обратитесь в ЦО.";  
				Предупреждение(ТекстПредупреждения, 60);
				Возврат;
			ИначеЕсли СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаОткрыта") Тогда
				//ИЛИ  СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта") Тогда 
			   ТекстПредупреждения = ТекстПредупреждения + " в сумке." + Символы.ПС + "Для переоформления ЗБ измените статус накладной и вскройте сумку.";	  
			   Предупреждение(ТекстПредупреждения, 60);
			   Возврат;
		    КонецЕсли;	   
		КонецЕсли;	
		
		СтруктураВозврата = Новый Структура;
	    СтруктураВозврата.Вставить("ПредыдущаяОперация", ТекущаяСтрока.ДокументЗалога);
	    СтруктураВозврата.Вставить("ВидОперации", ВидОперации); 
		ТекущаяСтрокаП = Элементы.Плательщики.ТекущиеДанные;
		Если ТекущаяСтрокаП = неопределено Тогда
			ТекПлательщик  = ТекущаяСтрока.Залогодатель;
		Иначе
			ТекПлательщик  = ТекущаяСтрокаП.Плательщик; 
		КонецЕсли;	  
		
		Если НЕ ТекущаяСтрока.ДатаСмерти = Дата(1,1,1) Тогда  
			Если ТекПлательщик  = ТекущаяСтрока.Залогодатель Тогда
				Сообщить("Дата смерти клиента " + Формат(ТекущаяСтрока.ДатаСмерти, "ДФ=dd.MM.yyyy") + ". Переоформление не возможено.");
				Возврат;  
			ИначеЕсли НЕ ЭтоНаследник(ТекущаяСтрокаП.ПолучитьИдентификатор()) Тогда
				Сообщить("У представителя умершего клиента нет свидетельства о праве на наследство. Переоформление не возможено.");
				Возврат;  
			КонецЕсли;	
			
			СтруктураВозврата.Вставить("Залогодатель", ТекПлательщик); 
			ДокументыОК = Истина;
			Клиент = ТекПлательщик;   
			Если НЕ ПроверитьДокументыКлиента(Клиент) тогда  
				ДокументыОК = ложь;
				Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОткрытиеКарточки", ЭтотОбъект); 
	            ПоказатьВопрос(Оповещение, "Открыть карточку клиента?", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
			КонецЕсли;	
            Если НЕ ДокументыОК Тогда
				Возврат;
			КонецЕсли;
			СтруктураВозврата.Вставить("ДокументЗалогодателя", ДокументЗалогодателя);  
			СтруктураВозврата.Вставить("ДоверенностьПредставителя", ТекущаяСтрокаП.Доверенность); 
			Этаформа.Закрыть(СтруктураВозврата);
		КонецЕсли; 

        Если НЕ ТекущаяСтрока.Залогодатель = ТекПлательщик Тогда
			СписокВыбора = Новый СписокЗначений; 

			СписокВыбора.Добавить(1, "Переоформить залоговый билет на имя заемщика"); 
			СписокВыбора.Добавить(2, "Переоформить залоговый билет на имя доверенного лица"); 

			ВыбранноеЗначение = ВыбратьИзМеню(СписокВыбора); 
			Если ВыбранноеЗначение = неопределено Тогда 
				Возврат;
			КонецЕсли;	

			Если ВыбранноеЗначение.Значение = 1 Тогда //залогодатель сохраняется
				//заемщик
                СтруктураВозврата.Вставить("Залогодатель", ТекущаяСтрока.Залогодатель);
				ДокументыОК = Истина;
				Клиент = ТекущаяСтрока.Залогодатель;   
				Если НЕ ПроверитьДокументыКлиента(Клиент) тогда  
					ДокументыОК = ложь;
					Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОткрытиеКарточки", ЭтотОбъект); 
		            ПоказатьВопрос(Оповещение, "Открыть карточку клиента?", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
				КонецЕсли;	
                Если НЕ ДокументыОК Тогда
					Возврат;
				КонецЕсли;
				СтруктураВозврата.Вставить("ДокументЗалогодателя", ДокументЗалогодателя);
				
				//представитель
				СтруктураВозврата.Вставить("Представитель", ТекПлательщик); 
				ПредставительКлиента = ТекПлательщик;
				Если НЕ ПроверитьДокументыПредставителяКлиента(ПредставительКлиента) тогда  
					ДокументыОК = ложь;
					Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОткрытиеКарточкиПлательщика", ЭтотОбъект); 
		            ПоказатьВопрос(Оповещение, "Открыть карточку представителя клиента?", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
				КонецЕсли;	
                Если НЕ ДокументыОК Тогда
					Возврат;
				КонецЕсли;
				СтруктураВозврата.Вставить("ДокументПредставителя", ДокументПредставителя);
				СтруктураВозврата.Вставить("ДоверенностьПредставителя", ТекущаяСтрокаП.Доверенность);
			ИначеЕсли ВыбранноеЗначение.Значение = 2 Тогда //залогодатель = плательщик
			    СтруктураВозврата.Вставить("Залогодатель", ТекПлательщик); 
				ДокументыОК = Истина;
				Клиент = ТекПлательщик;   
				Если НЕ ПроверитьДокументыКлиента(Клиент) тогда  
					ДокументыОК = ложь;
					Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОткрытиеКарточки", ЭтотОбъект); 
		            ПоказатьВопрос(Оповещение, "Открыть карточку клиента?", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
				КонецЕсли;	
                Если НЕ ДокументыОК Тогда
					Возврат;
				КонецЕсли;
				СтруктураВозврата.Вставить("ДокументЗалогодателя", ДокументЗалогодателя);  
				СтруктураВозврата.Вставить("ДоверенностьПредставителя", ТекущаяСтрокаП.Доверенность);
			КонецЕсли;     
		Иначе 
			СтруктураВозврата.Вставить("Залогодатель", ТекущаяСтрока.Залогодатель);       
			ДокументыОК = Истина;
			Клиент = ТекущаяСтрока.Залогодатель;   
			Если НЕ ПроверитьДокументыКлиента(Клиент) тогда  
				ДокументыОК = ложь;
				Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОткрытиеКарточки", ЭтотОбъект); 
	            ПоказатьВопрос(Оповещение, "Открыть карточку клиента?", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
			КонецЕсли;	
            Если НЕ ДокументыОК Тогда
				Возврат;
			КонецЕсли;
			СтруктураВозврата.Вставить("ДокументЗалогодателя", ДокументЗалогодателя);
		КонецЕсли;	
		Этаформа.Закрыть(СтруктураВозврата);
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда   
		//+Мельников 15.07.24 Проверка на банкрота
		Если ПроверитьСтатусБанкрот(ТекущаяСтрока.Залогодатель) Тогда
			//+МАН 06.04.26 Изменил. Заявка 3759
			//Было:
			//Предупреждение("Залогодатель имеет статус ""Банкрот"". 
			//				|Выдача залога невозможна!");
			Предупреждение("Клиенту " + Строка(ТекущаяСтрока.Залогодатель) + " присвоен служебный статус ""Банкрот"", в связи с чем выдача залога клиенту/доверенному лицу запрещена!");
			//-МАН
			Возврат;
		КонецЕсли;
		//-Мельников
		
		Если НЕ ТекущаяСтрока = неопределено Тогда 
			ПараметрыФормы = Новый Структура;
		    ТекущаяСтрокаП = Элементы.Плательщики.ТекущиеДанные;
			Если ТекущаяСтрокаП = неопределено Тогда
				Клиент = ТекущаяСтрока.Залогодатель;
			Иначе
				Клиент = ТекущаяСтрокаП.Плательщик;
			КонецЕсли;						
			Если НЕ ПроверитьДокументыКлиента(Клиент) тогда
				Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОткрытиеКарточки", ЭтотОбъект); 
	            ПоказатьВопрос(Оповещение, "Открыть карточку клиента?", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
			Иначе  
				ОбработатьВыборКлиента();
			КонецЕсли;	
		КонецЕсли;      
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда 
		Если ТекущийЛомбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда 
			Если НЕ ПроверитьИзделияВЦО(ТекущаяСтрока.ДокументЗалога) Тогда 
			    Предупреждение("Изделия из залогового билета № " + СокрЛП(Номер) + " не найдены на складе ЦО.", 60);
			    Возврат;
			КонецЕсли;	
        Иначе
			Если ЕстьВНакладной Тогда    
			    СтруктураН = ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку);
	            ТекстПредупреждения = "Внимание! Изделия по ЗБ № " + СокрЛП(Номер) + " в накладной № " + СокрЛП(СтруктураН.Номер)+ " от " + Формат(СтруктураН.Дата, "ДЛФ=DT");
			    Если СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена") Тогда	
					ТекстПредупреждения = ТекстПредупреждения + " в статусе «Отгружено»." + Символы.ПС + "Для согласования возможности изъятия обратитесь в ЦО.";  
					Предупреждение(ТекстПредупреждения, 60);
					Возврат;
				ИначеЕсли СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаОткрыта") Тогда 
					//ИЛИ  СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта") Тогда 
				   ТекстПредупреждения = ТекстПредупреждения + " в сумке." + Символы.ПС + "Для изъятия изделий из ЗБ измените статус накладной и вскройте сумку.";	  
				   Предупреждение(ТекстПредупреждения, 60);
				   Возврат;
		        КонецЕсли;	   
			КонецЕсли;		   
		КонецЕсли;	
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ЗалоговыйБилет", ТекущаяСтрока.ДокументЗалога);
	    СтруктураВозврата.Вставить("ВидОперации", ВидОперации); 
		ЭтаФорма.Закрыть(СтруктураВозврата);	
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") ИЛИ 
			  ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОстановкаПроцентов") Тогда  
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ЗалоговыйБилет", ТекущаяСтрока.ДокументЗалога);
	    СтруктураВозврата.Вставить("ВидОперации", ВидОперации); 
		ЭтаФорма.Закрыть(СтруктураВозврата);		
	
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога") Тогда
		ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;
		Если НЕ ТекущаяСтрока = неопределено Тогда   
			ВидОперацииДокумент = ПолучитьОперациюЗалога(ТекущаяСтрока.ДокументЗалога);
			Если НЕ ВидОперацииДокумент = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") Тогда 
				Предупреждение("Займ был выдан через операцию """ + Строка(ВидОперацииДокумент) + 
				        """. Для отмены операции необходимо выбрать операцию """ + Строка(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления")) +""".", 60);
				ЭтаФорма.Закрыть(); 
				Возврат;
			КонецЕсли;	
			ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор(); 
			Если ПроверитьВремяОтВыдачиЗБ(ИдентификаторСтроки) > 1 Тогда  
				Предупреждение("Со времени выдачи залогового билета прошло больше 1 часа. Отмена выдачи займа невозможна.", 60);
				ЭтаФорма.Закрыть(); 
				Возврат;
			КонецЕсли;	    
			ВидСледующейОперации = ПроверитьОперацииПоЗалоговомуБилету(ИдентификаторСтроки); 
			Если НЕ ВидСледующейОперации = неопределено тогда 
				Предупреждение("По выбранному залоговому билету оформлена операция " + строка(ВидСледующейОперации) + ". Отмена выдачи займа невозможна.", 60);
				ЭтаФорма.Закрыть();
				Возврат;
			КонецЕсли;
			СтруктураВозврата = Новый Структура;
			СтруктураВозврата.Вставить("ЗалоговыйБилет", ТекущаяСтрока.ДокументЗалога);
		    СтруктураВозврата.Вставить("ВидОперации", ВидОперации); 
			ЭтаФорма.Закрыть(СтруктураВозврата);  
		КонецЕсли;       
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления") Тогда
		Если НЕ ТекущаяСтрока = неопределено Тогда   
			ВидОперацииДокумент = ПолучитьОперациюЗалога(ТекущаяСтрока.ДокументЗалога);
			Если НЕ ВидОперацииДокумент = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
				Предупреждение("Займ был выдан через операцию """ + Строка(ВидОперацииДокумент) + 
				        """. Для отмены операции необходимо выбрать операцию """ + Строка(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога")) +""".", 60);
				ЭтаФорма.Закрыть(); 
				Возврат;
			КонецЕсли;	
			ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор(); 
			Если ПроверитьВремяОтВыдачиЗБ(ИдентификаторСтроки) > 1 Тогда  
				Предупреждение("Со времени переоформления залогового билета прошло больше 1 часа. Отмена переоформления займа невозможна.", 60);
				ЭтаФорма.Закрыть(); 
				Возврат;
			КонецЕсли;	    
			ВидСледующейОперации = ПроверитьОперацииПоЗалоговомуБилету(ИдентификаторСтроки); 
			Если НЕ ВидСледующейОперации = неопределено тогда 
				Предупреждение("По выбранному залоговому билету оформлена операция " + строка(ВидСледующейОперации) + ". Отмена переоформления займа невозможна.", 60);
				ЭтаФорма.Закрыть();
				Возврат;
			КонецЕсли;
			СтруктураВозврата = Новый Структура;
			СтруктураВозврата.Вставить("ЗалоговыйБилет", ТекущаяСтрока.ДокументЗалога);
		    СтруктураВозврата.Вставить("ВидОперации", ВидОперации); 
			ЭтаФорма.Закрыть(СтруктураВозврата);  
		КонецЕсли; 
	
	//+Мельников 25.04.24 Отмена операций 
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты") Тогда
    	Если НЕ ТекущаяСтрока = Неопределено Тогда
			
			ПоследняяОперация = ПолучитьПоследнююОперацию(ТекущаяСтрока.ПолучитьИдентификатор());
			Если ТекущийЛомбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда 
				ЛомбардПользователя = ТекущийЛомбард; 
			Иначе	
			    ЛомбардПользователя = ПолучитьЛомбардПольвателя(); 
			КонецЕсли;	
			//+Мельников 19.06.24
			Если ПоследняяОперация <> Неопределено Тогда
				ЛомбардВДокументе = ПолучитьЛомбардВдокументе(ПоследняяОперация.ДокументОперации);
			Иначе
				Залогодатели.Очистить();
				Операции.Очистить();
				Возврат;
			КонецЕсли;
			//-Мельников
			
			Если ПоследняяОперация <> Неопределено Тогда
				
				Если ЛомбардПользователя <> ЛомбардВДокументе Тогда
					Предупреждение("Операция оформлена в другом ломбарде.
					|Действия с документом запрещены!");
					Возврат
				КонецЕсли;

				Если Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") <> Формат(ПоследняяОперация.Дата, "ДФ=dd.MM.yyyy") Тогда
					Предупреждение("Отмена операции возможна только в текущем дне.");
					Возврат
				КонецЕсли;
				
				Если НЕ ПоследняяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") И
					 НЕ ПоследняяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда
					Если ТекущаяДата() - ПоследняяОперация.Дата >= 3600 Тогда
						Предупреждение("Прошло больше часа со времени оформления операции. Отмена невозможна.");
						Возврат
					КонецЕсли; 
				КонецЕсли;	

				Если ПоследняяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВозвратаИзъятого") ИЛИ
					ПоследняяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога") ИЛИ
					ПоследняяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаИзъятия") ИЛИ
					ПоследняяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты") ИЛИ
					ПоследняяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОстановкиНачисленияПроцентов") ИЛИ
					ПоследняяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления") ИЛИ
					ПоследняяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВыдачиСОХ") Тогда

					Предупреждение("Выбран документ с видом операции " + Строка(ПоследняяОперация.ВидОперации) + ". Отмена операции невозможна.", 60);
					ЭтаФорма.Закрыть(); 
					Возврат;
				КонецЕсли;
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("ЗалоговыйБилет", ТекущаяСтрока.ДокументЗалога);
				СтруктураВозврата.Вставить("ВидОперации", ПоследняяОперация.ВидОперации); //ВидОперации
				СтруктураВозврата.Вставить("НомерЗалоговогоБилета", Номер);
				//СтруктураВозврата.Вставить("СтатусЗалоговогоБилета", ТекущаяСтрока.СтатусЗалоговогоБилета);
				ЭтаФорма.Закрыть(СтруктураВозврата);
			КонецЕсли;
		КонецЕсли; 
		//-Мельников
	КонецЕсли;	
	////+МАН 27.10.25
	//Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") //Выдача займа
	//	ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") //Оплата процентов
	//	ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") //Переоформление
	//	ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда //Выдача залога
	//	
	//	ЕстьСовпадение = ПроверитьКлиента(ТекущаяСтрока.Залогодатель);
	//	
	//	Если ЕстьСовпадение Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	////-МАН
КонецПроцедуры 

&НаСервере
Функция ПроверитьВремяОтВыдачиЗБ(Идентификатор) 
	Часы = 0 ;
	СтрЗБ = Залогодатели.НайтиПоИдентификатору(Идентификатор);
	Если НЕ СтрЗБ = неопределено Тогда
	    ЗалоговыйБилет = СтрЗБ.ДокументЗалога;  
	    Часы = (ТекущаяДата() - ЗалоговыйБилет.Дата)/3600;
    КонецЕсли;
    Возврат Часы;
КонецФункции	

&НаСервере
Функция ПроверитьОперацииПоЗалоговомуБилету(Идентификатор)
	СтрЗБ = Залогодатели.НайтиПоИдентификатору(Идентификатор);
	Если НЕ СтрЗБ = неопределено Тогда  
		ЗалоговыйБилет = СтрЗБ.ДокументЗалога; 
		Возврат ЛБ_УправлениеЛомбардом.ПроверитьЕстьОперацииПоЗалоговомуБилету(ТекущаяДата(), ЗалоговыйБилет);
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

&НаКлиенте
Процедура ПослеОтветаНаВопросОткрытиеКарточки(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда  
		ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияКлиента",ЭтаФорма);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", ТекущаяСтрока.Залогодатель);
		ПараметрыФормы.Вставить("ПричинаИзменения", ПредопределенноеЗначение("Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИсправлениеДанныхКонтактнаяИнформация")); 
		ПараметрыФормы.Вставить("ЗакрыватьПриСохранении", Истина);  
		Если ЭтаФорма.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда   
			ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе	
		    ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПослеОтветаНаВопросОткрытиеКарточкиПлательщика(Результат, Параметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда  
		ТекущаяСтрока = Элементы.Плательщики.ТекущиеДанные;
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияКлиента",ЭтаФорма);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", ТекущаяСтрока.Плательщик);
		ПараметрыФормы.Вставить("ПричинаИзменения", ПредопределенноеЗначение("Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИсправлениеДанныхКонтактнаяИнформация")); 
		ПараметрыФормы.Вставить("ЗакрыватьПриСохранении", Истина);
		Если ЭтаФорма.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда   
			ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе	
		    ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияКлиента(Результат, ДопПараметры) Экспорт
	ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = неопределено Тогда 		
	    ТекущаяСтрокаП = Элементы.Плательщики.ТекущиеДанные;
		Если ТекущаяСтрокаП = неопределено Тогда
			Клиент = ТекущаяСтрока.Залогодатель;
		Иначе
			Клиент = ТекущаяСтрокаП.Плательщик;
		КонецЕсли;						
		Если НЕ ПроверитьДокументыКлиента(Клиент) тогда
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОткрытиеКарточки", ЭтотОбъект); 
	        ПоказатьВопрос(Оповещение, "Открыть карточку клиента?", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
		Иначе  
			ОбработатьВыборКлиента();
		КонецЕсли;	
	КонецЕсли;     	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборКлиента() 
	ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = неопределено Тогда
		
		// ++ Сербаев 20.06.2023  разрешаем платить третьим лицам по займам умерших.
		//Если НЕ ТекущаяСтрока.ДатаСмерти = Дата(1,1,1) Тогда
		//	Сообщить("Дата смерти клиента " + Формат(ТекущаяСтрока.ДатаСмерти, "ДФ=dd.MM.yyyy") + ". Выбор не возможен.");
		//	Возврат;
		//КонецЕсли; 
        // -- Сербаев 20.06.2023

	    СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ПредыдущаяОперация", ТекущаяСтрока.ДокументЗалога);
		СтруктураВозврата.Вставить("ВидОперации", ВидОперации);     
		ТекущаяСтрокаП = Элементы.Плательщики.ТекущиеДанные;
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда		
			Если ТекущаяСтрокаП = неопределено Тогда
				СтруктураВозврата.Вставить("Плательщик", ТекущаяСтрока.Залогодатель);
				СтруктураВозврата.Вставить("Доверенность", ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка"));
			Иначе
				СтруктураВозврата.Вставить("Плательщик", ТекущаяСтрокаП.Плательщик);
				СтруктураВозврата.Вставить("Доверенность", ТекущаяСтрокаП.Доверенность);
			КонецЕсли;	       
		ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда  
			Если ТекущаяСтрокаП = неопределено Тогда
				СтруктураВозврата.Вставить("Получатель", ТекущаяСтрока.Залогодатель);
				СтруктураВозврата.Вставить("Доверенность", ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка"));
			Иначе
				СтруктураВозврата.Вставить("Получатель", ТекущаяСтрокаП.Плательщик); 
				СтруктураВозврата.Вставить("Доверенность", ТекущаяСтрокаП.Доверенность);
			КонецЕсли;	
		КонецЕсли;	
		СтруктураВозврата.Вставить("ДокументЗалогодателя", ДокументЗалогодателя);
		ЭтаФорма.Закрыть(СтруктураВозврата);
	КонецЕсли;	                  
КонецПроцедуры

&НаСервере
Процедура ЗаполитьПлательщиков(Идентификатор) 
	Стр = Залогодатели.НайтиПоИдентификатору(Идентификатор);
	Плательщики.Очистить();   
	Если Стр.ДатаСмерти = Дата(1,1,1) Тогда
		НоваяСтр = Плательщики.Добавить();
		НоваяСтр.Плательщик = Стр.Залогодатель; 
		НоваяСтр.Статус = "Клиент";  
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("ЗалоговыйБилет", Стр.ДокументЗалога);
	Запрос.УстановитьПараметр("Клиент", Стр.Залогодатель); 	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность.ПредставительКлиента КАК Представитель,
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И Клиент = &Клиент) КАК ЛБ_ДоверенностиСрезПоследних";  
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл  
		Если НЕ Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			Продолжить; 
		ИначеЕсли НЕ (Стр.ДатаСмерти = Дата(1,1,1)) И НЕ (Выборка.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство) Тогда
			Продолжить;
		КонецЕсли;	 
		Если (Выборка.Доверенность.СрокДействияДоверенности  < ТекущаяДата()) И НЕ (Выборка.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство) Тогда
			Продолжить;
		КонецЕсли;	  
		НоваяСтр = Плательщики.Добавить();
	    НоваяСтр.Плательщик = Выборка.Представитель;
		НоваяСтр.Доверенность = Выборка.Доверенность;     
		Если Выборка.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда 
			НоваяСтр.ДоверенностьСтрока = "Свидетельство о праве на наследство № " + СокрЛП(Выборка.Доверенность.НомерДоверенности) + " от " + Формат(Выборка.Доверенность.ДатаДоверенности, "ДФ=dd.MM.yyyy");
		Иначе  	
			НоваяСтр.ДоверенностьСтрока = "Доверенность " + НРег(строка(Выборка.Доверенность.ВидДоверенности)) + " № " +
				   СокрЛП(Выборка.Доверенность.НомерДоверенности) + " от " + Формат(Выборка.Доверенность.ДатаДоверенности, "ДФ=dd.MM.yyyy") +
				   " действует до " + Формат(Выборка.Доверенность.СрокДействияДоверенности, "ДФ=dd.MM.yyyy");  
		КонецЕсли;		   
		НоваяСтр.Статус = "Представитель";
	Конеццикла;	
	Если НЕ Плательщики.Количество() = 0 Тогда  
		Элементы.Плательщики.ТекущаяСтрока  = Плательщики[0].ПолучитьИдентификатор();
	КонецЕсли;	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗалогодателиПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.Залогодатели.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда 
		ЗаполитьПлательщиков(ТекСтрока.ПолучитьИдентификатор());  
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции. Заполняем последниюю операцию
	Если ТекСтрока <> Неопределено И ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты") Тогда 
		ЗаполитьОперации(ТекСтрока.ПолучитьИдентификатор());  
	КонецЕсли;
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьКлиента();
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораПлательщиков() 
	СписокВыбора = Новый СписокЗначений; 

	Отбор = новый Структура;
	Отбор.Вставить("Статус", "Клиент"); 
	СтрокиП = Плательщики.НайтиСтроки(Отбор);  
	Если НЕ СтрокиП.Количество() = 0 Тогда		
		Запрос = Новый Запрос;  
		Запрос.УстановитьПараметр("Клиент", СтрокиП.Получить(0).Плательщик);
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЛБ_ПлательщикиКлиента.Плательщик КАК Плательщик
		               |ИЗ
		               |	РегистрСведений.ЛБ_ПлательщикиКлиента КАК ЛБ_ПлательщикиКлиента
		               |ГДЕ
		               |	ЛБ_ПлательщикиКлиента.Клиент = &Клиент";
		Выборка = Запрос.Выполнить().Выбрать(); 
		Пока Выборка.Следующий() Цикл 
			СписокВыбора.Добавить(Выборка.Плательщик);
		КонецЦикла;  
	КонецЕсли;
	
	Возврат СписокВыбора; 
КонецФункции

&НаКлиенте
Процедура СоздатьПлательщика(Команда)  
	ТекСтрока = Элементы.Залогодатели.ТекущиеДанные;
	СписокВыбора = ПолучитьСписокВыбораПлательщиков();  
	Если СписокВыбора.Количество() = 0 Тогда 
		ПараметрыФормы = новый структура;
		ПараметрыФормы.Вставить("БезДокументов", Истина);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДругогоПлательщика",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	Иначе	
		СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.ЛБ_Залогодатели.ПустаяСсылка"), "Новый плательщик");
		ВыбранноеЗначение = ВыбратьИзМеню(СписокВыбора, Элементы.Плательщики); 
		Если ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Справочник.ЛБ_Залогодатели.ПустаяСсылка") Тогда	
			ПараметрыФормы = новый структура;
		    ПараметрыФормы.Вставить("БезДокументов", Истина);
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДругогоПлательщика",ЭтаФорма);
			ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
		Иначе
			НоваяСтр = Плательщики.Добавить();   
			НоваяСтр.Плательщик = ВыбранноеЗначение.Значение;
			НоваяСтр.Статус = "Третье лицо";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораДругогоПлательщика(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	НоваяСтр = Плательщики.Добавить();   
	НоваяСтр.Плательщик = Результат.Залогодатель;
	НоваяСтр.Статус = "Третье лицо";
КонецПроцедуры	

//+Мельников 25.04.24 Отмена операции
&НаСервере
Процедура ЗаполитьОперации(Идентификатор)
	
	Стр = Залогодатели.НайтиПоИдентификатору(Идентификатор);
	Операции.Очистить();
	
	ПоследняяОперация = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(Стр.Номер, ТекущаяДата(), Истина);
	
	//+Мельников 06.05.24 Сделано на время тестирования. Убрать при запуске ломбардов.
	Если ПоследняяОперация = Неопределено Тогда
		ДатаПроверки = ТекущаяДата() + 94608000; // + три года к дате проверки документа
		ПоследняяОперация = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(Стр.Номер, ДатаПроверки, Истина);
	КонецЕсли;
	//-Мельников

	//+Мельников 19.06.24
	Если ПоследняяОперация <> Неопределено Тогда
		НоваяСтр = Операции.Добавить();
		НоваяСтр.ДатаИНомерДокумента = "От " + ПоследняяОперация.Регистратор.Дата + ", № " + ПоследняяОперация.Регистратор.Номер;
		НоваяСтр.ДокументОперации = ПоследняяОперация.Регистратор;
		НоваяСтр.ВидОперации = ПоследняяОперация.Регистратор.ВидОперации;
		НоваяСтр.СтатусЗБ = ПоследняяОперация.СтатусЗалоговогоБилета;
	КонецЕсли;
	//-Мельников
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОперации(Ссылка)
	Возврат Ссылка.ВидОперации;
КонецФункции

&НаСервере
Функция ПолучитьПоследнююОперацию(Идентификатор)

	Стр = Залогодатели.НайтиПоИдентификатору(Идентификатор);
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(Стр.Номер, ТекущаяДата(), Истина);
	
	//+Мельников 06.05.24 Сделано на время тестирования. Убрать при запуске ломбардов.
	Если Результат = Неопределено Тогда
		ДатаПроверки = ТекущаяДата() + 94608000; // + три года к дате проверки документа
		Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(Стр.Номер, ДатаПроверки, Истина);
	КонецЕсли;
	//-Мельников

	//+Мельников 19.06.24
	Если Результат <> Неопределено Тогда
		ПоследняяОперация = Новый Структура;
		ПоследняяОперация.Вставить("Дата", Результат.Регистратор.Дата);
		ПоследняяОперация.Вставить("ВидОперации", Результат.Регистратор.ВидОперации);
		ПоследняяОперация.Вставить("ДокументОперации", Результат.Регистратор);
		
		Возврат ПоследняяОперация;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	//-Мельников
	
КонецФункции

&НаКлиенте
Процедура ЛДУ_ОперацииВыборВместо(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьКлиента();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЛомбардПольвателя()
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардВдокументе(Ссылка)
	Возврат Ссылка.Ломбард;
КонецФункции

//+Мельников 15.07.24 Проверка на банкрота
&НаСервере
Функция ПроверитьСтатусБанкрот(Залогодатель)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется
		|ИЗ
		|	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(
		|			&Дата,
		|			Залогодатель = &Залогодатель
		|				И Статус.Несостоятельный = ИСТИНА) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	//Запрос.УстановитьПараметр("Статус", Справочники.ЛБ_СлужебныеСтатусыКлиентов.НайтиПоКоду("000000003"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Используется;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//-Мельников

//+МАН 27.10.25
&НаСервере
Функция ПроверитьКлиента(Залогодатель)
	СтруктураПроверки = ЛБ_ОбщегоНазначения.ПроверитьКлиентаПоПеречням(Залогодатель);

	Возврат СтруктураПроверки.Совпадение;
	//Возврат ЛБ_ОбщегоНазначения.ПроверитьКлиентаПоПеречням(Залогодатель);
КонецФункции
//-МАН
